## Introducing pandas dtypes

In [111]:
import pandas as pd
import numpy as np

In [112]:
# Defining column names and values

column_names = ["Customer ID", "Customer Name",\
               "2018 Revenue", "2019 Revenue",\
               "Growth", "Start Year", "Start Month",\
               "Start Day", "New Customer"]

row1 = list([1001.0, 'Pandas Banking',\
            '€235000', '€248000',\
            '5.5%', 2013, 3, 10, 0])

row2 = list([1002.0, 'Pandas Grocery',\
            '€196000', '€205000',
             '4.5%', 2016, 4, 30, 0])

row3 = list([1003.0, 'Pandas Telecom',\
            '€167000', '€1930000', '15.5%',\
            2010, 11, 24, 0])

row4 = list([1004.0, 'Pandas Transport',\
            '€79000', '€90000', '13.9%',\
            2018, 1, 15, 1])

row5 = list([1005.0, 'Pandas Insurance',\
            '€241000', '264000', '9.5%',\
            2009, 6, 1, 0])

In [113]:
# Creating dataframes

data_frame = pd.DataFrame(data=[row1, row2, row3, row4, row5],\
                         columns= column_names)

data_frame

,Customer ID,Customer Name,2018 Revenue,2019 Revenue,Growth,Start Year,Start Month,Start Day,New Customer
0,1001.0,Pandas Banking,€235000,€248000,5.5%,2013,3,10,0
1,1002.0,Pandas Grocery,€196000,€205000,4.5%,2016,4,30,0
2,1003.0,Pandas Telecom,€167000,€1930000,15.5%,2010,11,24,0
3,1004.0,Pandas Transport,€79000,€90000,13.9%,2018,1,15,1
4,1005.0,Pandas Insurance,€241000,264000,9.5%,2009,6,1,0

In [114]:
# Adding values for 2018 and 2019 revenues

data_frame['2018 Revenue'] + data_frame['2019 Revenue']

0     €235000€248000
1     €196000€205000
2    €167000€1930000
3       €79000€90000
4      €241000264000
dtype: object

In [115]:
# Checking the data types

data_frame.dtypes

Customer ID      float64
Customer Name     object
2018 Revenue      object
2019 Revenue      object
Growth            object
Start Year         int64
Start Month        int64
Start Day          int64
New Customer       int64
dtype: object

In [116]:
# Getting details of the data types

data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer ID    5 non-null      float64
 1   Customer Name  5 non-null      object
 2   2018 Revenue   5 non-null      object
 3   2019 Revenue   5 non-null      object
 4   Growth         5 non-null      object
 5   Start Year     5 non-null      int64
 6   Start Month    5 non-null      int64
 7   Start Day      5 non-null      int64
 8   New Customer   5 non-null      int64
dtypes: float64(1), int64(4), object(4)
memory usage: 488.0+ bytes

In [117]:
# Converting from one type into another

data_frame['Customer ID'] = data_frame['Customer ID'].astype('int')
data_frame['Customer ID']

0    1001
1    1002
2    1003
3    1004
4    1005
Name: Customer ID, dtype: int32

In [118]:
data_frame['2018 Revenue'] = data_frame['2018 Revenue'].astype('int')
data_frame['2018 Revenue']

ValueError: invalid literal for int() with base 10: '€235000'

In [119]:
# Revoming the € 

def remove_currency(column):
    new_column = column.replace('€','')
    return int(new_column)

In [120]:
data_frame['2018 Revenue'] = \
data_frame['2018 Revenue'].apply(remove_currency)
data_frame['2018 Revenue']

0    235000
1    196000
2    167000
3     79000
4    241000
Name: 2018 Revenue, dtype: int64

In [121]:
data_frame['2019 Revenue'] = \
data_frame['2019 Revenue'].apply(remove_currency)
data_frame['2019 Revenue']

0     248000
1     205000
2    1930000
3      90000
4     264000
Name: 2019 Revenue, dtype: int64

In [122]:
def remove_percent(column):
    new_column = column.replace('%','')
    return new_column

data_frame['Growth'] = \
data_frame['Growth'].apply(remove_percent)
data_frame['Growth']

0     5.5
1     4.5
2    15.5
3    13.9
4     9.5
Name: Growth, dtype: object

In [123]:
# Renaming columns

data_frame.rename(columns={'Start Year': 'year',\
                           'Start Month': 'month',\
                           'Start Day': 'day'},\
                 inplace=True)

data_frame['Starting Date'] = \
pd.to_datetime(data_frame[['day', 'month', 'year']])
data_frame['Starting Date']

0   2013-03-10
1   2016-04-30
2   2010-11-24
3   2018-01-15
4   2009-06-01
Name: Starting Date, dtype: datetime64[ns]

In [124]:
# Converting int into bool

data_frame["New Customer"] = data_frame['New Customer'].astype('bool')
data_frame["New Customer"]

0    False
1    False
2    False
3     True
4    False
Name: New Customer, dtype: bool

In [125]:
data_frame["Customer Name"] = \
data_frame["Customer Name"].astype('category')
data_frame["Customer Name"]

0      Pandas Banking
1      Pandas Grocery
2      Pandas Telecom
3    Pandas Transport
4    Pandas Insurance
Name: Customer Name, dtype: category
Categories (5, object): ['Pandas Banking', 'Pandas Grocery', 'Pandas Insurance', 'Pandas Telecom', 'Pandas Transport']

In [126]:
data_frame.dtypes

Customer ID               int32
Customer Name          category
2018 Revenue              int64
2019 Revenue              int64
Growth                   object
year                      int64
month                     int64
day                       int64
New Customer               bool
Starting Date    datetime64[ns]
dtype: object

In [127]:
# Summing columns

data_frame['2019 Revenue'] + data_frame['2018 Revenue']

0     483000
1     401000
2    2097000
3     169000
4     505000
dtype: int64

In [128]:
# Finding out the number of days

data_frame['Starting Date'] - pd.to_datetime('2020-09-01')

0   -2732 days
1   -1585 days
2   -3569 days
3    -960 days
4   -4110 days
Name: Starting Date, dtype: timedelta64[ns]

#### Exercise 4.01 - underlying data types and conversion

In [129]:
# Importing libraries
import pandas as pd

In [130]:
# Loading the file as a DataFrame

data = pd.read_csv('c:retail_purchase.csv')
data

,Receipt Id,Date of Purchase,Product Name,Product Weight,Total Price,Retail shop name
0,10001,24/05/20,Wheat,4.8lb,€17,Fline Store
1,10002,05/05/20,Fruit Juice,3.1lb,€19,Dello Superstore
2,10003,27/04/20,Vegetables,1.2lb,€15,Javies Retail
3,10004,05/05/20,Oil,3.1lb,€17,Javies Retail
4,10005,27/04/20,Wheat,4.8lb,€13,Javies Retail
...,...,...,...,...,...,...
99995,109996,24/05/20,Oil,4.8lb,€25,Visco Retail
99996,109997,20/04/20,Rice,3.1lb,€12,Kelly Superstore
99997,109998,08/01/20,Fruit Juice,2.7lb,€24,Dello Superstore
99998,109999,05/05/20,Butter,3.1lb,€22,Dello Superstore
99999,110000,17/04/20,Bread,4.4lb,€27,Visco Retail

In [131]:
# Displaying first five rows
data.tail()

,Receipt Id,Date of Purchase,Product Name,Product Weight,Total Price,Retail shop name
99995,109996,24/05/20,Oil,4.8lb,€25,Visco Retail
99996,109997,20/04/20,Rice,3.1lb,€12,Kelly Superstore
99997,109998,08/01/20,Fruit Juice,2.7lb,€24,Dello Superstore
99998,109999,05/05/20,Butter,3.1lb,€22,Dello Superstore
99999,110000,17/04/20,Bread,4.4lb,€27,Visco Retail

In [132]:
# Displaying panda data types
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Receipt Id        100000 non-null  int64
 1   Date of Purchase  100000 non-null  object
 2   Product Name      100000 non-null  object
 3   Product Weight    100000 non-null  object
 4   Total Price       100000 non-null  object
 5   Retail shop name  100000 non-null  object
dtypes: int64(1), object(5)
memory usage: 4.6+ MB

In [133]:
data.dtypes

Receipt Id           int64
Date of Purchase    object
Product Name        object
Product Weight      object
Total Price         object
Retail shop name    object
dtype: object

In [134]:
# Converting Date of Purchase into datetime

data['Date of Purchase'] = pd.to_datetime(data['Date of Purchase'], format='%d/%m/%y')

data['Date of Purchase']

0       2020-05-24
1       2020-05-05
2       2020-04-27
3       2020-05-05
4       2020-04-27
           ...
99995   2020-05-24
99996   2020-04-20
99997   2020-01-08
99998   2020-05-05
99999   2020-04-17
Name: Date of Purchase, Length: 100000, dtype: datetime64[ns]

In [135]:
# Removing the € form Total Price

def remove_euro(column):
    new_column = column.replace('€','')
    return new_column

data['Total Price'] = data['Total Price'].apply(remove_euro)

data['Total Price']

0        17
1        19
2        15
3        17
4        13
         ..
99995    25
99996    12
99997    24
99998    22
99999    27
Name: Total Price, Length: 100000, dtype: object

In [136]:
# Converting Total Price into a float and then display it

data['Total Price'] = data['Total Price'].astype('float')

data['Total Price']

0        17.0
1        19.0
2        15.0
3        17.0
4        13.0
         ...
99995    25.0
99996    12.0
99997    24.0
99998    22.0
99999    27.0
Name: Total Price, Length: 100000, dtype: float64

In [137]:
# Removing lb from Product Weight

def remove_lb(column):
    new_column = column.replace('lb','')
    return new_column

data['Product Weight'] = data['Product Weight'].apply(remove_lb)
data['Product Weight']

0        4.8
1        3.1
2        1.2
3        3.1
4        4.8
        ...
99995    4.8
99996    3.1
99997    2.7
99998    3.1
99999    4.4
Name: Product Weight, Length: 100000, dtype: object

In [138]:
# Converting lb into a float

data['Product Weight'] = data['Product Weight'].astype('float')

data['Product Weight']

0        4.8
1        3.1
2        1.2
3        3.1
4        4.8
        ...
99995    4.8
99996    3.1
99997    2.7
99998    3.1
99999    4.4
Name: Product Weight, Length: 100000, dtype: float64

In [139]:
# Using the unique function to find every unique value from Product Name

data['Product Name'].unique()

array(['Wheat', 'Fruit Juice', 'Vegetables', 'Oil', 'Butter', 'Fruits',
       'Cheese', 'Rice', 'Bread'], dtype=object)

In [140]:
# Convert Product Name into a category

data['Product Name'] = data['Product Name'].astype('category')
data['Product Name']

0              Wheat
1        Fruit Juice
2         Vegetables
3                Oil
4              Wheat
            ...
99995            Oil
99996           Rice
99997    Fruit Juice
99998         Butter
99999          Bread
Name: Product Name, Length: 100000, dtype: category
Categories (9, object): ['Bread', 'Butter', 'Cheese', 'Fruit Juice', ..., 'Oil', 'Rice', 'Vegetables', 'Wheat']

In [141]:
# Using the unique(function for Retail shop name)

data['Retail shop name'].unique()

array(['Fline Store', 'Dello Superstore', 'Javies Retail',
       'Oldi Superstore', 'Kanes Store', 'Kelly Superstore',
       'Visco Retail', 'Rotero Retail'], dtype=object)

In [142]:
# Converting Retail shop name into a category

data['Retail shop name'] = data['Retail shop name'].astype('category')
data['Retail shop name']

0             Fline Store
1        Dello Superstore
2           Javies Retail
3           Javies Retail
4           Javies Retail
               ...
99995        Visco Retail
99996    Kelly Superstore
99997    Dello Superstore
99998    Dello Superstore
99999        Visco Retail
Name: Retail shop name, Length: 100000, dtype: category
Categories (8, object): ['Dello Superstore', 'Fline Store', 'Javies Retail', 'Kanes Store', 'Kelly Superstore', 'Oldi Superstore', 'Rotero Retail', 'Visco Retail']

In [143]:
# Displaying data types after convertion

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Receipt Id        100000 non-null  int64
 1   Date of Purchase  100000 non-null  datetime64[ns]
 2   Product Name      100000 non-null  category
 3   Product Weight    100000 non-null  float64
 4   Total Price       100000 non-null  float64
 5   Retail shop name  100000 non-null  category
dtypes: category(2), datetime64[ns](1), float64(2), int64(1)
memory usage: 3.2 MB

## Missing data types

In [144]:
data_frame.drop(['year', 'month', 'day'], axis=1, inplace=True)

data_frame.iloc[0,0] = None
data_frame.iloc[4,1] = None
data_frame.iloc[2,2] = None
data_frame.iloc[3,3] = None
data_frame.iloc[3,4] = None
data_frame.iloc[1,5] = None
data_frame.iloc[2,6] = None

data_frame

,Customer ID,Customer Name,2018 Revenue,2019 Revenue,Growth,New Customer,Starting Date
0,NaN,Pandas Banking,235000.0,248000.0,5.5,False,2013-03-10
1,1002.0,Pandas Grocery,196000.0,205000.0,4.5,NaN,2016-04-30
2,1003.0,Pandas Telecom,NaN,1930000.0,15.5,False,NaT
3,1004.0,Pandas Transport,79000.0,NaN,None,True,2018-01-15
4,1005.0,NaN,241000.0,264000.0,9.5,False,2009-06-01

In [110]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer ID    4 non-null      float64
 1   Customer Name  4 non-null      category
 2   2018 Revenue   4 non-null      float64
 3   2019 Revenue   4 non-null      float64
 4   Growth         4 non-null      object
 5   New Customer   4 non-null      object
 6   Starting Date  4 non-null      datetime64[ns]
dtypes: category(1), datetime64[ns](1), float64(3), object(2)
memory usage: 585.0+ bytes

In [145]:
# Converting nullable data types into other data types
data_frame['Customer ID'] =\
data_frame['Customer ID'].astype('int')
data_frame['Customer ID']

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [147]:
# Converting Customer Name into an object
data_frame['Customer Name'] =\
data_frame['Customer Name'].astype('object')

data_frame['Customer Name']

0      Pandas Banking
1      Pandas Grocery
2      Pandas Telecom
3    Pandas Transport
4                 NaN
Name: Customer Name, dtype: object

In [148]:
# Converting New Customer back into bool

data_frame['New Customer'] =\
data_frame['New Customer'].astype('bool')
data_frame['New Customer']

0    False
1     True
2    False
3     True
4    False
Name: New Customer, dtype: bool

In [150]:
# Calculating the differences between Starting Date and 2020-09-01

data_frame['Starting Date'] - pd.to_datetime('2020-09-01')

0   -2732 days
1   -1585 days
2          NaT
3    -960 days
4   -4110 days
Name: Starting Date, dtype: timedelta64[ns]

### Exercise 4.02 missing data and converting into non-nullabla dtypes

In [155]:
# Importing libraries
import pandas as pd

In [156]:
# Loading csv file
data_retail = pd.read_csv('C:retail_purchase_missing.csv')

In [157]:
# Displaying dataframe
data_retail.head()

,Receipt Id,Date of Purchase,Product Name,Product Weight,Total Price,Retail shop name
0,10001.0,24/05/20,Wheat,87.0,99.0,NaN
1,NaN,05/05/20,NaN,NaN,25.0,Dello Superstore
2,10003.0,27/04/20,Vegetables,19.0,37.0,Javies Retail
3,10004.0,05/05/20,Oil,99.0,44.0,Javies Retail
4,10005.0,NaN,Wheat,30.0,NaN,Javies Retail

In [158]:
# Displaying data types
data_retail.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58 entries, 0 to 57
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Receipt Id        44 non-null     float64
 1   Date of Purchase  46 non-null     object
 2   Product Name      46 non-null     object
 3   Product Weight    51 non-null     float64
 4   Total Price       51 non-null     float64
 5   Retail shop name  45 non-null     object
dtypes: float64(3), object(3)
memory usage: 2.8+ KB

In [163]:
# Replacing missing values by 0 with fillna() fuction

data_retail.fillna(value = {'Receipt Id': 0, \
                           'Product Weight': 0, \
                           'Total Price': 0}, \
                  inplace= True)

data_retail.head()

,Receipt Id,Date of Purchase,Product Name,Product Weight,Total Price,Retail shop name
0,10001.0,24/05/20,Wheat,87.0,99.0,NaN
1,0.0,05/05/20,NaN,0.0,25.0,Dello Superstore
2,10003.0,27/04/20,Vegetables,19.0,37.0,Javies Retail
3,10004.0,05/05/20,Oil,99.0,44.0,Javies Retail
4,10005.0,NaN,Wheat,30.0,0.0,Javies Retail

In [165]:
# Replacing the missing values in the Date of purchase
data_retail.fillna(value= {'Date of Purchase': '01/01/99'}, inplace =True)

data_retail.head()

,Receipt Id,Date of Purchase,Product Name,Product Weight,Total Price,Retail shop name
0,10001.0,24/05/20,Wheat,87.0,99.0,NaN
1,0.0,05/05/20,NaN,0.0,25.0,Dello Superstore
2,10003.0,27/04/20,Vegetables,19.0,37.0,Javies Retail
3,10004.0,05/05/20,Oil,99.0,44.0,Javies Retail
4,10005.0,01/01/99,Wheat,30.0,0.0,Javies Retail

In [172]:
# Replacing the missing values with Missing Name in the remaining columns 

data_retail.fillna(value= {'Product Name':'Missing Name', \
                           'Retail shop name': 'Missing Name'}, inplace= True)

data_retail.head()

,Receipt Id,Date of Purchase,Product Name,Product Weight,Total Price,Retail shop name
0,10001.0,24/05/20,Wheat,87.0,99.0,Mssing Name
1,0.0,05/05/20,Missing Name,0.0,25.0,Dello Superstore
2,10003.0,27/04/20,Vegetables,19.0,37.0,Javies Retail
3,10004.0,05/05/20,Oil,99.0,44.0,Javies Retail
4,10005.0,01/01/99,Wheat,30.0,0.0,Javies Retail

In [173]:
# Converting the data types of the columns 

data_retail['Date of Purchase'] = \
pd.to_datetime(data_retail['Date of Purchase'], \
               format='%d/%m/%y')

data_retail['Receipt Id'] = \
data_retail['Receipt Id'].astype('int')

data_retail['Total Price'] = \
data_retail['Total Price'].astype('int')

data_retail['Product Weight'] = \
data_retail['Product Weight'].astype('int')

data_retail['Product Name'] = \
data_retail['Product Name'].astype('category')

data_retail['Retail shop name'] = \
data_retail['Retail shop name'].astype('category')

data_retail.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58 entries, 0 to 57
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Receipt Id        58 non-null     int32
 1   Date of Purchase  58 non-null     datetime64[ns]
 2   Product Name      58 non-null     category
 3   Product Weight    58 non-null     int32
 4   Total Price       58 non-null     int32
 5   Retail shop name  58 non-null     category
dtypes: category(2), datetime64[ns](1), int32(3)
memory usage: 2.1 KB

## Activity 4.01 - optimizing memory usage by converting into the appropriate dtypes

In [210]:
# 2. Importing libraries
import pandas as pd

In [211]:
# 3. Loading the csv file as Data Frame

data_car = pd.read_csv('c:car.csv')

In [212]:
# 4. Displaying the first 10 rows

data_car.head(10)

  buying  maint  doors  persons lug_boot safety  class
0  vhigh  vhigh      2      2.0    small    low  unacc
1  vhigh  vhigh      2      2.0    small    med  unacc
2  vhigh  vhigh      2      NaN    small   high  unacc
3  vhigh  vhigh      2      2.0      med    low  unacc
4  vhigh  vhigh      2      2.0      med    med  unacc
5    NaN  vhigh      2      2.0      med   high    NaN
6  vhigh  vhigh      2      2.0      big    low  unacc
7  vhigh  vhigh      2      2.0      big    NaN  unacc
8  vhigh  vhigh      2      2.0      big   high  unacc
9  vhigh    NaN      2      4.0    small    low  unacc

In [213]:
# 5. Display the data types of each column in the DataFrame

data_car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1728 entries, 0 to 1727
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   buying    1727 non-null   object
 1   maint     1727 non-null   object
 2   doors     1728 non-null   int64
 3   persons   1151 non-null   float64
 4   lug_boot  1728 non-null   object
 5   safety    1727 non-null   object
 6   class     1727 non-null   object
dtypes: float64(1), int64(1), object(5)
memory usage: 94.6+ KB

In [214]:
# 6. Replacing the missing values appropriately

data_car.fillna(value = {'persons': round(data_car.persons.mean()), \
                         'doors': round(data_car.doors.mean()) }, inplace= True)

data_car.fillna(value = {'buying': 'missing info',\
                         'maint': 'missing info',\
                         'lug_boot': 'missing info',\
                         'safety': 'missing info',\
                         'class': 'missing info'}, inplace= True)


data_car.head(10)

,buying,maint,doors,persons,lug_boot,safety,class
0,vhigh,vhigh,2,2.0,small,low,unacc
1,vhigh,vhigh,2,2.0,small,med,unacc
2,vhigh,vhigh,2,3.0,small,high,unacc
3,vhigh,vhigh,2,2.0,med,low,unacc
4,vhigh,vhigh,2,2.0,med,med,unacc
5,missing info,vhigh,2,2.0,med,high,missing info
6,vhigh,vhigh,2,2.0,big,low,unacc
7,vhigh,vhigh,2,2.0,big,missing info,unacc
8,vhigh,vhigh,2,2.0,big,high,unacc
9,vhigh,missing info,2,4.0,small,low,unacc

In [215]:
# 7. Counting the number of distinct unique values for buying, maint, doors, persons, lug_boot, safety, and class 

data_car['buying'].nunique()

5

In [216]:
data_car['maint'].nunique()

5

In [217]:
data_car['doors'].nunique()

4

In [218]:
data_car['persons'].nunique()

3

In [219]:
data_car['lug_boot'].nunique()

3

In [220]:
data_car['safety'].nunique()

4

In [221]:
data_car['class'].nunique()

5

In [222]:
# 8. Convert the object columns into category in the DataFrame

data_car['buying'] = \
data_car['buying'].astype('category')

data_car['maint'] = \
data_car['maint'].astype('category')


data_car['persons'] = \
data_car['persons'].astype('int')

data_car['lug_boot'] = \
data_car['lug_boot'].astype('category')

data_car['safety'] = \
data_car['safety'].astype('category')

data_car['class'] = \
data_car['class'].astype('category')

In [223]:
# 9. Displaying teh data types

data_car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1728 entries, 0 to 1727
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   buying    1728 non-null   category
 1   maint     1728 non-null   category
 2   doors     1728 non-null   int64
 3   persons   1728 non-null   int32
 4   lug_boot  1728 non-null   category
 5   safety    1728 non-null   category
 6   class     1728 non-null   category
dtypes: category(5), int32(1), int64(1)
memory usage: 29.8 KB

## Subsetting by data types

In [224]:
import pandas as pd

s = pd.Series(['pandas is awesome'])
s

0    pandas is awesome
dtype: object

In [225]:
# Using the split() method

s.str.split()

0    [pandas, is, awesome]
dtype: object

In [226]:
# Replacing the word pandas

s.str.replace('pandas', 'python')

0    python is awesome
dtype: object

In [228]:
# Counting the number of words
s.str.count('a')

0    3
dtype: int64

In [229]:
# Counting the number of characters
s.str.len()

0    17
dtype: int64

In [231]:
# Capitalizing the strings

s.str.capitalize()

0    Pandas is awesome
dtype: object

In [232]:
# Testing if our series only contains lowercase characters
s.str.islower()

0    True
dtype: bool

#### Working with the dtype category

In [236]:
# Defining a series with datetimes


s = pd.to_datetime(pd.Series(['1990-05-31 10:00',\
                             '1995-06-05 15:00',\
                             '2020-09-09 12:01']))
                             
s

0   1990-05-31 10:00:00
1   1995-06-05 15:00:00
2   2020-09-09 12:01:00
dtype: datetime64[ns]

In [237]:
# Displaying the date with date() method

s.dt.date

0    1990-05-31
1    1995-06-05
2    2020-09-09
dtype: object

In [238]:
# Displaying the time

s.dt.time

0    10:00:00
1    15:00:00
2    12:01:00
dtype: object

In [239]:
# Displaying the year

s.dt.year

0    1990
1    1995
2    2020
dtype: int64

In [241]:
# Displaying the day name of each date 

s.dt.day_name()

0     Thursday
1       Monday
2    Wednesday
dtype: object

#### Working with      dtype = timedelta64[ns]

In [242]:
# Defining a series with timedelta

s = pd.to_datetime(pd.Series(['1990-05-31',\
                              '1995-06-05',\
                              '2020-09-09']))\
- pd.to_datetime('2020-01-01')

s

0   -10807 days
1    -8976 days
2      252 days
dtype: timedelta64[ns]

In [243]:
# Displaying the number of seconds 

s.dt.total_seconds()

0   -933724800.0
1   -775526400.0
2     21772800.0
dtype: float64

In [244]:
# Displaying the series as datetime.timdelta array 

s.dt.to_pytimedelta()

array([datetime.timedelta(days=-10807), datetime.timedelta(days=-8976),
       datetime.timedelta(days=252)], dtype=object)

In [245]:
# Displaying each time component
s.dt.components

    days  hours  minutes  seconds  milliseconds  microseconds  nanoseconds
0 -10807      0        0        0             0             0            0
1  -8976      0        0        0             0             0            0
2    252      0        0        0             0             0            0

### Exercise 4.03 - working with text data using string methods

In [246]:
# 2. Importing pandas using the following command
import pandas as pd

In [250]:
# 3. Creating a series with text data

s = pd.Series\
(['Data Analysis using python with pandas is great',
 'pandas DataFrame and pandas series are useful', 
 'PYTHON3 PANDAS'])

s

0    Data Analysis using python with pandas is great
1      pandas DataFrame and pandas series are useful
2                                     PYTHON3 PANDAS
dtype: object

In [251]:
# 4. Counting the number of times that pandas appears in the series
s.str.count('pandas')

0    1
1    2
2    0
dtype: int64

In [252]:
# 5. Counting the number of characters in each string
s.str.len()

0    47
1    45
2    14
dtype: int64

In [253]:
# 6. Removing white spaces 
s.str.strip().str.len()

0    47
1    45
2    14
dtype: int64

In [255]:
# 7. Checking if each string starts with letter p

s.str.startswith('p')

0    False
1     True
2    False
dtype: bool

In [259]:
# 8. Using a combination of functions to force all the strings to start with letter p

s.str.strip().str.replace('Data', 'pandas').str.lower().str.startswith('p')

0    True
1    True
2    True
dtype: bool

In [260]:
# 9. Using the get_dummies() fucntion to create a DataFrame of dummy variables

s.str.get_dummies(' ')

,Analysis,Data,DataFrame,PANDAS,PYTHON3,and,are,great,is,pandas,python,series,useful,using,with
0,1,1,0,0,0,0,0,1,1,1,1,0,0,1,1
1,0,0,1,0,0,1,1,0,0,1,0,1,1,0,0
2,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0

In [266]:
# 10. Using a combination of functions to create a DataFrame of dummy variables that contains only pandas and python

s = s.str.strip().str.lower()
s.str.get_dummies(' ')[['python','pandas']]

   python  pandas
0       1       1
1       0       1
2       0       1

#### Selecting data in a DataFrame by its dtype

In [272]:
import pandas as pd
import numpy as np

column_names = ['Customer ID', 'Customer Name',\
                '2018 Revenue', '2019 Revenue',\
                'Growth', 'Start year', 'Start Month',\
                'Start Day', 'New Customer']

row1 = list([1001.0, 'Pandas Banking', '235000',\
            '24800', '5.5', 2013, 3, 10, 0])

row2 = list([1002.0, 'Pandas Grocery', '196000', '205000',\
            '4.5', 2016, 4, 30, 0])

row3 = list([1003.0, 'Pandas Telecom', '167000',\
            '19300', '15.5', 2010, 11, 24, 0])

row4 = list([1004.0, 'Pandas Transport', '79000',\
            '90000', '13.9', 2018, 1, 15, 1])

row5 = list([1005.0, 'Pandas Insurance', '241000',\
            '26400', '9.5', 2009, 6, 1, 0])

data_frame = pd.DataFrame(data=[row1, row2, row3, row4, row5],\
                         columns=column_names)

data_frame

,Customer ID,Customer Name,2018 Revenue,2019 Revenue,Growth,Start year,Start Month,Start Day,New Customer
0,1001.0,Pandas Banking,235000,24800,5.5,2013,3,10,0
1,1002.0,Pandas Grocery,196000,205000,4.5,2016,4,30,0
2,1003.0,Pandas Telecom,167000,19300,15.5,2010,11,24,0
3,1004.0,Pandas Transport,79000,90000,13.9,2018,1,15,1
4,1005.0,Pandas Insurance,241000,26400,9.5,2009,6,1,0

In [274]:
data_frame.dtypes

Customer ID      float64
Customer Name     object
2018 Revenue      object
2019 Revenue      object
Growth            object
Start year         int64
Start Month        int64
Start Day          int64
New Customer       int64
dtype: object

In [275]:
# selecting only dtype columns 
data_frame.select_dtypes('object')

      Customer Name 2018 Revenue 2019 Revenue Growth
0    Pandas Banking       235000        24800    5.5
1    Pandas Grocery       196000       205000    4.5
2    Pandas Telecom       167000        19300   15.5
3  Pandas Transport        79000        90000   13.9
4  Pandas Insurance       241000        26400    9.5

In [280]:
# Selecting only numeric columns
data_frame.select_dtypes('number')

   Customer ID  Start year  Start Month  Start Day  New Customer
0       1001.0        2013            3         10             0
1       1002.0        2016            4         30             0
2       1003.0        2010           11         24             0
3       1004.0        2018            1         15             1
4       1005.0        2009            6          1             0

In [282]:
# Selecting numeric columns and excluding int64

data_frame.select_dtypes('number', exclude='int64')

   Customer ID
0       1001.0
1       1002.0
2       1003.0
3       1004.0
4       1005.0